tom38121605/sample_mcu_STM32C011F6_all/_03_03_I2C主动模式示例/示例03_hal库i2c合并到LL库工程-af-24c02-af-readwrite-multibytes-ok-k/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention

  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "crc.h"
#include "i2c.h"
#include "spi.h"
#include "tim.h"
#include "usart.h"
#include "gpio.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdio.h>           
#include "string.h"           
#include "spi.h"              

#include "stm32c0xx_hal_flash.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

#define LOCALSLAVEADDR  1
uint8_t islaveaddrin=0;

uint8_t slavecmd[TXDATALEN]={0}; 


#define DATA_MMC0_POINT  5
#define DATA_MMC1_POINT  12
#define DATA_ICM0_POINT  19
#define DATA_TIME_POINT  31


uint32_t idataoff =0;
uint32_t irestlen =0;

#define PAGE_DATA_SIZE  256  //2048             
uint32_t icrctempdata[PAGE_DATA_SIZE/4+1]={0}; 

uint8_t FLASHTEMPDATA[PAGE_DATA_SIZE]= {0}; 
uint32_t ialldatalen=0;
uint32_t istepdatalen=0;
uint8_t flg_haverest =0;


/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

  
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

uint32_t  immc0_ctrl_0=0;
uint32_t  immc1_ctrl_0=0;

//---MMC5983---  

#define MMC5983_XOUT_REG            0x00
#define MMC5983_TOUT_REG            0x07
#define MMC5983_STATUS_REG          0x08
#define MMC5983_CONTROL0_REG        0x09
#define MMC5983_CONTROL1_REG        0x0A
#define MMC5983_CONTROL2_REG        0x0B
#define MMC5983_CONTROL3_REG        0x0C
#define MMC5983_PRODUCT_ID_REG      0x2F

#define MMC5983_PRODUCT_ID_RESULT   0x30

#define MMC5983_MYSTERY_REG 0x29
#define MMC5983_MYSTERY_TC_DISABLE 0x01
#define MMC5983_UNLOCK_REG 0x0F
#define MMC5983_UNLOCK_VAL 0xE1

//MEMSIC values
#define MMC5983_CONTROL0_MAG_MEAS   0x01
#define MMC5983_CONTROL0_TEMP_MEAS  0x02
#define MMC5983_CONTROL0_INT_EN     0x04
#define MMC5983_CONTROL0_SET        0x08
#define MMC5983_CONTROL0_RESET      0x10
#define MMC5983_CONTROL0_AUTOSREN   0x20   //add

#define MMC5983_CONTROL0_INIT       0x00
#define MMC5983_CONTROL0_START_TEMP_CMD  (MMC5983_CONTROL0_TEMP_MEAS | MMC5983_CONTROL0_RESET)
#define MMC5983_CONTROL0_START_CMD  (MMC5983_CONTROL0_MAG_MEAS)

#ifdef OMMO_SENSOR_MEMSIC_MMC5983_SET
  #define MMC5983_CONTROL0_SET_CMD    (MMC5983_CONTROL0_SET)
#else
  #define MMC5983_CONTROL0_SET_CMD    (MMC5983_CONTROL0_RESET) //RESET will invert the axis making them right handed
#endif

#define MMC5983_CONTROL1_CHIP_RESET 0x80
#define MMC5983_CONTROL1_BW_100     0x00
#define MMC5983_CONTROL1_BW_200     0x01
#define MMC5983_CONTROL1_BW_400     0x02
#define MMC5983_CONTROL1_BW_800     0x03
#define MMC5983_CONTROL1_INIT       MMC5983_CONTROL1_BW_8

#define MMC5983_CONTROL2_CM_FREQ_1000  0X07    //add
#define MMC5983_CONTROL2_CMM_EN        0X08    //add
 
//---ICM42605---  
// Bank 0
#define ICM_DEVICE_ID                          0x42  

#define ICM42605_DEVICE_CONFIG_REG             0x11    
#define ICM42605_INT_CONFIG_REG                0x14   
#define ICM42605_ACCEL_DATA_X1_REG             0x1F  

#define ICM42605_INT_STATUS_REG                0x2D      

#define ICM42605_PWR_MGMT0_REG                 0x4E     
#define ICM42605_GYRO_CONFIG0_REG              0x4F     
#define ICM42605_ACCEL_CONFIG0_REG             0x50   
#define ICM42605_GYRO_CONFIG1_REG              0x51   

#define ICM42605_INT_CONFIG1_REG               0x64  
#define ICM42605_INT_SOURCE0_REG               0x65  
#define ICM42605_WHO_AM_I_REG                  0x75          

#define ICM42605_REG_BANK_SEL_REG              0x76      

// Bank 4
#define ICM42605_APEX_CONFIG5_REG              0x44   


/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */


//-------------flash-------------

#define ADDR_FLASH_PAGE_0     ((uint32_t)0x08000000) /* Base @ of Page 0, 2 Kbytes */
#define ADDR_FLASH_PAGE_1     ((uint32_t)0x08000800) /* Base @ of Page 1, 2 Kbytes */
#define ADDR_FLASH_PAGE_2     ((uint32_t)0x08001000) /* Base @ of Page 2, 2 Kbytes */
#define ADDR_FLASH_PAGE_3     ((uint32_t)0x08001800) /* Base @ of Page 3, 2 Kbytes */
#define ADDR_FLASH_PAGE_4     ((uint32_t)0x08002000) /* Base @ of Page 4, 2 Kbytes */
#define ADDR_FLASH_PAGE_5     ((uint32_t)0x08002800) /* Base @ of Page 5, 2 Kbytes */
#define ADDR_FLASH_PAGE_6     ((uint32_t)0x08003000) /* Base @ of Page 6, 2 Kbytes */
#define ADDR_FLASH_PAGE_7     ((uint32_t)0x08003800) /* Base @ of Page 7, 2 Kbytes */
#define ADDR_FLASH_PAGE_8     ((uint32_t)0x08004000) /* Base @ of Page 8, 2 Kbytes */
#define ADDR_FLASH_PAGE_9     ((uint32_t)0x08004800) /* Base @ of Page 9, 2 Kbytes */
#define ADDR_FLASH_PAGE_10    ((uint32_t)0x08005000) /* Base @ of Page 10, 2 Kbytes */
#define ADDR_FLASH_PAGE_11    ((uint32_t)0x08005800) /* Base @ of Page 11, 2 Kbytes */
#define ADDR_FLASH_PAGE_12    ((uint32_t)0x08006000) /* Base @ of Page 12, 2 Kbytes */
#define ADDR_FLASH_PAGE_13    ((uint32_t)0x08006800) /* Base @ of Page 13, 2 Kbytes */
#define ADDR_FLASH_PAGE_14    ((uint32_t)0x08007000) /* Base @ of Page 14, 2 Kbytes */
#define ADDR_FLASH_PAGE_15    ((uint32_t)0x08007800) /* Base @ of Page 15, 2 Kbytes */
#define ADDR_FLASH_PAGE_16    ((uint32_t)0x08008000)  


//#define DATA_64                 ((uint64_t)0x12345678aa345678)


#define FLASH_BASE_ADDR          ((uint32_t)0x08000000)  
#define FLASH_PAGESIZE           ((uint32_t)0x800)           //2K


#define FLASH_OFFSET_START_PAGE         6  
#define FLASH_OFFSET_START_ADDR  ( (uint32_t)(FLASH_BASE_ADDR + FLASH_OFFSET_START_PAGE * FLASH_PAGESIZE) )  //3000

#define FLASH_BOOTFLAG_START_PAGE       14  
#define FLASH_BOOTFLAG_START_ADDR  ( (uint32_t)(FLASH_BASE_ADDR + FLASH_BOOTFLAG_START_PAGE * FLASH_PAGESIZE) )  //7000

