tom38121605/sample_mcu_STM32C011F6_all/_03_03_I2C主动模式示例/示例03_hal库i2c合并到LL库工程-af-24c02-af-readwrite-multibytes-ok-k/Core/Src/main.c
////      //unfrozen  test
////      mmc1_write_byte(MMC5983_CONTROL0_REG,MMC5983_CONTROL0_AUTOSREN|MMC5983_CONTROL0_INT_EN);      //auto ser/reset, enable interrupt    
////      mmc1_write_byte(MMC5983_CONTROL2_REG,MMC5983_CONTROL2_CM_FREQ_1000| MMC5983_CONTROL2_CMM_EN); //1000Hz, continuous mode
////      LL_mDelay(1);  
////      mmc1_write_byte(MMC5983_CONTROL0_REG,MMC5983_CONTROL0_INIT);   //0  
////      immc1_ctrl_0=MMC5983_CONTROL0_INIT;		 
////      mmc1_write_byte(MMC5983_CONTROL2_REG,0x00);       

      //reset   
      mmc1_write_byte(MMC5983_CONTROL1_REG,MMC5983_CONTROL1_CHIP_RESET);  //reset
      LL_mDelay(20);                    

      //set control 0  
      mmc1_write_byte(MMC5983_CONTROL0_REG,MMC5983_CONTROL0_INIT);   //0  
      immc1_ctrl_0	= MMC5983_CONTROL0_INIT;		
       
      //set control 1   
      mmc1_write_byte(MMC5983_CONTROL1_REG,MMC5983_CONTROL1_BW_800);    //800Hz
    
   }
   else
   {
      //flg_mmc1_ready=0;
      //iputs1("mmc1 err");   
   }     
   
}

void mmc1_read_data(uint8_t *sdata, uint8_t ilen)
{
   static uint32_t ireadcount = 0;

   //start sample
   //mmc1_write_byte(MMC5983_CONTROL0_REG, immc1_ctrl_0 & 0x7f);  	
   //mmc1_write_byte(MMC5983_CONTROL0_REG, MMC5983_CONTROL0_MAG_MEAS);    //sample

   //read data
   mmc1_readfromspi(MMC5983_XOUT_REG, ilen, sdata);

   //set/reset + Temp command
   if (ireadcount>=1000)
   {
      ireadcount =0;    
      mmc1_write_byte(MMC5983_CONTROL0_REG, immc1_ctrl_0 & 0x7f);      
      mmc1_write_byte(MMC5983_CONTROL0_REG, MMC5983_CONTROL0_TEMP_MEAS | MMC5983_CONTROL0_RESET ); 
      mmc1_write_byte(MMC5983_CONTROL1_REG, MMC5983_CONTROL1_BW_800);    //800Hz   
   }   
   
}   


//---------------------mmc1 module----end-----------------------


//---------------------icm0 module---------------------------

uint8_t icm0_read_byte(uint8_t addr)
{
   uint8_t value;

   LL_GPIO_ResetOutputPin((GPIO_TypeDef *)GPIOA, LL_GPIO_PIN_2);

   SPI_transfer(0x80|addr );
   value  = SPI_transfer(0x00);

   LL_GPIO_SetOutputPin((GPIO_TypeDef *)GPIOA, LL_GPIO_PIN_2);

   return value;
}

void icm0_write_byte(uint8_t addr,  uint8_t value)
{ 
   LL_GPIO_ResetOutputPin((GPIO_TypeDef *)GPIOA, LL_GPIO_PIN_2);

   SPI_transfer(addr);
   SPI_transfer(value);

   LL_GPIO_SetOutputPin((GPIO_TypeDef *)GPIOA, LL_GPIO_PIN_2); 
}

void icm0_read_bytes(uint8_t addr ,uint8_t length ,uint8_t *buffer)
{
   //read data
   for(int index = 0; index < length; index++)
   {
      buffer[index]  = icm0_read_byte(addr+index);
   } 
 
}

void icm0_readfromspi( uint8_t iaddr, uint8_t ilen, uint8_t *idata)
{ 
   LL_GPIO_ResetOutputPin((GPIO_TypeDef *)GPIOA, LL_GPIO_PIN_2);      

   SPI_transfer(0x80 |iaddr);

   while(ilen--)
   {
      *idata  = SPI_transfer(0x00);
      idata++;
   }

   LL_GPIO_SetOutputPin((GPIO_TypeDef *)GPIOA, LL_GPIO_PIN_2); 
}
   

void icm0_init(void)   
{
   uint8_t ivalue=0;

   icm0_write_byte( ICM42605_REG_BANK_SEL_REG, 0x00);    // set bank0

   //check device id
   ivalue =icm0_read_byte(ICM42605_WHO_AM_I_REG);     //read device id 
   if(ivalue == ICM_DEVICE_ID)  
   {
      //flg_icm0_ready=1;      
      //iputs1("icm0 ok");       

      icm0_write_byte(ICM42605_DEVICE_CONFIG_REG, 0x01 );     //reset   
      LL_mDelay(100);     

      icm0_write_byte(ICM42605_PWR_MGMT0_REG, 0x0f);     // set GYRO and ACC in LN mode    
      LL_mDelay(1);

      icm0_write_byte( ICM42605_GYRO_CONFIG0_REG, 0x06 | (3 << 5) );  //GYRO ODR 1KHz,GYRO FS 250dps   
      icm0_write_byte(ICM42605_ACCEL_CONFIG0_REG, 0x06 | (3 << 5) );   //ACC ODR 1kHz, ACC FS  2g
      icm0_write_byte( ICM42605_GYRO_CONFIG1_REG, 0xD6);              //DLPF BW=5Hz; DLPF Latency=32ms, GYRO UI 2nd Order , DEC2 M2 3nd Order
      icm0_write_byte( ICM42605_INT_CONFIG_REG, 0x03);    //INT1  Push pull, Active high
      icm0_write_byte( ICM42605_INT_CONFIG1_REG, 0x00);    //proper INT1 and INT2 pin operation
      icm0_write_byte(ICM42605_INT_SOURCE0_REG, 0x09);     //UI data ready interrupt routed to INT1, UI AGC ready interrupt routed to INT1

      icm0_write_byte( ICM42605_REG_BANK_SEL_REG, 0x04);    //set bank 4     
      icm0_write_byte( ICM42605_INT_SOURCE0_REG, 0x8F);    //Defines mounting matrix, chip to device frame
      icm0_write_byte( ICM42605_REG_BANK_SEL_REG, 0x00);    //set bank0

      ivalue=icm0_read_byte(0x2d);     //INT STATUS
   }
   else
   {
      //flg_icm0_ready=0;
      //iputs1("icm0 err");   
   }     
   
}
 

void icm0_read_data(uint8_t *sdata, uint8_t ilen) 
{
   //--uint8_t ivalue=0;

   icm0_write_byte( 0x76, 0x00);    // set bank0	
   //--ivalue=icm0_read_byte(0x2d);      //INT STATUS

   icm0_readfromspi(0x1f, ilen, sdata);
}   

//---------------------icm0 module----end-----------------------


void uartsendcmd(uint8_t *scmd, uint32_t ilen)
{
   //switch to tx 
   delay_nop(WAIT2TE_SLAVE); //delay_nop(WAIT2TE_MASTER);  
   switch2send(USART1); 

   //iputbytes1((uint8_t *)scmd,ilen);     
   iputbytes1(scmd,ilen);     

   //switch to rx
   delay_nop(WAIT2RE_SLAVE);  //delay_nop(WAIT2RE0_MASTER);    
   switch2read(USART1);   
}   
 
////void savetoflash(void)  
////{
//////   uint32_t icrc=0;
//////   uint32_t icrclen=0;
//////   uint32_t icrcin=0;
////   uint8_t flg_flasherr=0; 

////   //---------------  erease the flash -----------------

////   HAL_FLASH_Unlock();

////   __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_OPTVERR);

////   EraseInitStruct.TypeErase   = FLASH_TYPEERASE_PAGES;
////   EraseInitStruct.Page        = FLASH_EEPROM_START_PAGE;          //15, 0800 7800
////   EraseInitStruct.NbPages     = 1;                         //1 x 800 

////   if (HAL_FLASHEx_Erase(&EraseInitStruct, &PageError) != HAL_OK)
////   {
////      flg_flasherr=1;    
////   }

////   //---------------  write buf to flash -----------------

////   iflashaddr = FLASH_EEPROM_START_ADDR;   //0800 7800

////   for(uint32_t i=0; i<ialldatalen; i+=8)
////   {
////      if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, iflashaddr, *(uint64_t*)(&FLASHTEMPDATA[i]) ) == HAL_OK)
////      {
////         iflashaddr += 8;  //move 8 bytes
////      }
////      else
////      {
////         flg_flasherr=1; 
////      }               
////   }           

////   HAL_FLASH_Lock();  
////   

////   if(flg_flasherr==1)
////   {
////      flg_flasherr=0;
////      uartsendcmd( (uint8_t*)"flash err\r\n", 8);   
////   }        
////   
////}   

void dowithuart(void)
{   
   uint16_t itimnum=0;
   uint32_t ipackdatalen=0;
//   uint8_t stest[20]={0};
   uint32_t icrc=0;
   uint32_t icrclen=0;
   uint32_t icrcin=0;  
   static uint32_t icrcstep=0;
   
