tom38121605/sample_mcu_STM32C011F6_all/_03_03_I2C主动模式示例/示例03_hal库i2c合并到LL库工程-af-24c02-af-readwrite-multibytes-ok-k/Core/Src/main.c
   return (icrc_out);
}


uint32_t calcu_crc32ex(uint32_t *idatain, uint32_t len, uint32_t icrc_in)
{
   uint32_t icrc_poly = 0x04C11DB7;  
   uint32_t icrc_out = icrc_in;  

   for(uint32_t i = 0; i < len; i++)
   {
      icrc_out ^= idatain[i];        
      
      //Send_Data_To_UART1(i);  //test

      for (uint8_t j = 0; j < 32; j++)
      {
         if (icrc_out & 0x80000000)
            icrc_out = (icrc_out << 1) ^ icrc_poly;
         else
            icrc_out <<= 1;
      }
   }
   
   return (icrc_out);
}

uint32_t stm32_crc32(uint32_t *idatain, uint32_t len)
{
//   register uint32_t data = 0;
//   register uint32_t index = 0;
   
   LL_CRC_SetInitialData(CRC, LL_CRC_DEFAULT_CRC_INITVALUE);

   for(uint32_t i = 0; i < len; i++)
   {
      LL_CRC_FeedData32(CRC,  idatain[i]);
   }

   return (LL_CRC_ReadData32(CRC));
}

uint32_t stm32_crc32ex(uint32_t *idatain, uint32_t len, uint32_t icrc_in)
{
//   register uint32_t data = 0;
//   register uint32_t index = 0;
   
   LL_CRC_SetInitialData(CRC, icrc_in);

   for(uint32_t i = 0; i < len; i++)
   {
      LL_CRC_FeedData32(CRC,  idatain[i]);
   }

   return (LL_CRC_ReadData32(CRC));
}

//---------------------bootload ---------------------------

typedef void (*iapfun)(void);
iapfun jump2app;

void MSR_MSP(uint32_t addr)
{   
   __ASM("MSR MSP, r0");  
   __ASM(" BX r14");  
   
//   __ASM("msr msp, r0");  
//   __ASM("bx lr");  
}


void iap_load_app(uint32_t appxaddr)
{ 
   if(((*(__IO uint32_t*)appxaddr)&0x2FFE0000)==0x20000000)  
   {  
      jump2app=(iapfun)*(__IO uint32_t*)(appxaddr+4);  
      //MSR_MSP(*(__IO uint32_t*)appxaddr);  
      jump2app();  

   }      
}

//---------------------bootload ----end-----------------------


void software_reset(void)
{
   NVIC_SystemReset();
}


uint8_t i2c_writereg(uint16_t idevaddr, uint8_t ireg,uint8_t data)
{
   if((HAL_I2C_Mem_Write(&hi2c1,idevaddr,ireg,I2C_MEMADD_SIZE_8BIT,&data,1,1000)) == HAL_OK)
   {
      return 0;
   }
   else
   {
      return 1;
   }
}

uint8_t i2c_readreg(uint16_t idevaddr,uint8_t ireg)
{
   uint8_t res;
   HAL_I2C_Mem_Read(&hi2c1,idevaddr,ireg,I2C_MEMADD_SIZE_8BIT,&res,1,1000);
   return res;
}

uint8_t i2c_writebytes(uint16_t idevaddr, uint8_t ireg, uint8_t *sbuf,uint16_t ilen)
{
   if((HAL_I2C_Mem_Write(&hi2c1,idevaddr,ireg,I2C_MEMADD_SIZE_8BIT,sbuf,ilen,1000)) == HAL_OK)
   {
      return 0;
   }
   else
   {
      return 1;
   }
}

uint8_t i2c_readbytes(uint16_t idevaddr,uint8_t ireg,uint8_t *sbuf,uint16_t ilen)
{
   if((HAL_I2C_Mem_Read(&hi2c1,idevaddr,ireg,I2C_MEMADD_SIZE_8BIT,sbuf,ilen,1000)) == HAL_OK)
   {
      return 0;
   }
   else
   {
      return 1;
   }
}


/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

   //SCB->VTOR = FLASH_BASE_ADDR + FLASH_OFFSET_START_PAGE * FLASH_PAGESIZE;    //VECT_TAB_OFFSET

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */


  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USART1_UART_Init();
  MX_TIM1_Init();
  MX_SPI1_Init();
  MX_TIM17_Init();
  MX_CRC_Init();
  MX_I2C1_Init();
  /* USER CODE BEGIN 2 */
    
   //LL_RCC_ConfigMCO(LL_RCC_MCO1SOURCE_SYSCLK, LL_RCC_MCO1_DIV_4);   //12Mhz = 48Mhz/4


   LL_mDelay(10);  //20
   uartsendcmd( (uint8_t*)"start",5);     //start  
   
   LL_SPI_Enable(SPI1);     

   //sensor init 
   mmc0_init();
   mmc1_init();
   icm0_init();

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  
  while (1)
  {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
////     
//////-------------test 24c02 onebyte----------------------
////     
//////uartsendcmd((uint8_t*)"run\r\n",5); 
////     
////uint8_t itemp=0;
////uint32_t idelay=50000;
////     
////i2c_writereg( 0xA0,0x03,6);   
////delay_nop(idelay);        
////itemp=i2c_readreg( 0xA0,0x03); 
////     
//////Send_Data_To_UART1(itemp);  
////uartsendcmd( (uint8_t*)&itemp,1);      
////     
////i2c_writereg( 0xA0,0x03,8);
////delay_nop(idelay);     
////itemp=i2c_readreg( 0xA0,0x03);    
////uartsendcmd( (uint8_t*)&itemp,1);  
////  
//////-------------test 24c02 onebyte----end------------------


//-------------test 24c02 towbyte----------------------
     
//uartsendcmd((uint8_t*)"run\r\n",5); 
     
uint8_t sout[2]={0};
uint8_t sin[2]={0};
uint32_t idelay=500000;
  
//1st
sout[0]=6; sout[1]=6;
i2c_writebytes( 0xA0,0x03,sout,2);   
delay_nop(idelay);   

sin[0]=0; sin[1]=0;
i2c_readbytes( 0xA0,0x03,sin,2);   
uartsendcmd( sin,2);      
     
//2nd
sout[0]=8; sout[1]=8;
i2c_writebytes( 0xA0,0x03,sout,2);   
delay_nop(idelay);   

sin[0]=0; sin[1]=0;
i2c_readbytes( 0xA0,0x03,sin,2);   
uartsendcmd( sin,2);      
  
//-------------test 24c02 twobyte----end------------------

  
LL_mDelay(1000);         
     
  }  
    
   while (1)
   { 
      static uint32_t iuart_rxledcount=0;
      static uint32_t isensorcount=0;
      static uint32_t iresetcount=0;
      uint8_t ichecksum=0;      

    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */

      if(flg_timer1==1)
      {
         flg_timer1=0;
       
         iuart_rxledcount++;	
         isensorcount++;
         
         iresetcount++;
      }             
      
      //uart rx
      if (flg_rx==1)
      {
         flg_rx=0;   
         //uartsendcmd( (uint8_t*)"rx in\r\n",7); 

         islaveaddrin=irxdata2[4];

         //checksum
         ichecksum = get_checksum_8((uint8_t *)irxdata2,irxcount2-1);

         if(ichecksum == irxdata2[irxcount2-1])  
            if(islaveaddrin==LOCALSLAVEADDR)            
               dowithuart(); 
         
      }   
      
////      //read sensor data
////      if(isensorcount>=1)   //1* 1ms =1ms
////      {
////         isensorcount=0;  
////         //readsensor(); 
////      }	
      
